src/cf/Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СогласованоСБ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СогласованоРуководитель</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/КадроваяИстория.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>КадроваяИстория</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусПродавца</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусПродавца</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/СтатусПродавца.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>СтатусПродавца</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Откреплен</Name>
					<Comment>Откреплен</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прикреплен</Name>
					<Comment>Прикреплен</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОтпуске</Name>
					<Comment>В отпуске</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Уволен</Name>
					<Comment>Уволен</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/Пользователи/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	Если Не ЭтоНовый() Тогда
			
		Если (НЕ ПравоДоступа("Администрирование", Метаданные) 
			И (Ссылка.Код <> Код)) И (НЕ РольДоступна(Метаданные.Роли.СкладГуру)) И 
			(НЕ РольДоступна(Метаданные.Роли.tmp)) И
			(НЕ РольДоступна(Метаданные.Роли.МенеджерПоЗакупкам)) Тогда
			
			#Если Клиент Тогда
				
				Сообщить("Изменение кода существующего элемента справочника ""Пользователи"" запрещено. 
				|Изменение кода возможно только при наличии права ""Администрирование""", СтатусСообщения.Важное);
			
			#КонецЕсли
			Отказ = Истина;
			
		КонецЕсли;
			
	
	//++ Вялов В.Ю. - Мегаплан №3585 от 26.07.2016 - автоформирование пин-кода и статуса для нового
	Иначе
	// для нового продавца
	//	Если ЭтоНовый() Тогда
		ГруппаПользователи = Справочники.Пользователи.НайтиПоНаименованию("Продавцы", Истина, Справочники.Пользователи.ПустаяСсылка());
		//ГруппаМагазины = Справочники.Пользователи.НайтиПоНаименованию("Магазины", Истина, ГруппаПользователи);
		Если ЗначениеЗаполнено(ГруппаПользователи) Тогда
			Если ЭтотОбъект.ПринадлежитЭлементу(ГруппаПользователи) Тогда
				 
			
				
				ТекДата = ТекущаяДата();
				
				// Новый Пин-код (если это продавец!)
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"
					//|ВЫБРАТЬ
					//|	МАКСИМУМ(ВЫРАЗИТЬ(Пользователи.Код КАК ЧИСЛО(4))) КАК КодСайта
					|ВЫБРАТЬ
					//|ПЕРВЫЕ 100	
					|	ПОДСТРОКА(Пользователи.Код, 1, 4) КАК ПинКод
					|ИЗ
					|	Справочник.Пользователи КАК Пользователи						
					|ГДЕ
					|	Пользователи.Ссылка В ИЕРАРХИИ (&ГруппаПользователи)
					|УПОРЯДОЧИТЬ ПО
					|	 ПинКод УБЫВ
					|";	
				Запрос.УстановитьПараметр("ГруппаПользователи",	ГруппаПользователи);			
				РезультатЗапроса = Запрос.Выполнить();            	
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
				ЗнПинКод = 0;
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					//ЗнПинКод = ВыборкаДетальныеЗаписи.ПинКод;
					Попытка
						ЗнПинКод = Число(ВыборкаДетальныеЗаписи.ПинКод);
						бЭтоЧисло = Истина;
					Исключение
						бЭтоЧисло = Ложь;
					КонецПопытки;
					Если бЭтоЧисло Тогда
					//ВыборкаДетальныеЗаписи.ПинКод + 1;
						Если ЗнПинКод < 5000 Тогда
							ЗнПинКод = ЗнПинКод + 1;
							Прервать;
						КонецЕсли;	
					КонецЕсли;
				КонецЦикла;				
				Если ЗнПинКод > 0 Тогда
					ЭтотОбъект.Код = СокрЛП(Формат(ЗнПинКод, "ЧЦ=5; ЧГ=0"));			
				КонецЕсли;

				// новый статус
				Запрос = Новый Запрос;
				Запрос.Текст = "
					|ВЫБРАТЬ
					|	КадроваяИстория.Сотрудник КАК Сотрудник,
					|	КадроваяИстория.СтатусПродавца КАК СтатусПродавца
					|ИЗ
					|	РегистрСведений.КадроваяИстория.СрезПоследних(&ТекДата, 
					|		СтатусПродавца <> ЗНАЧЕНИЕ(Перечисление.СтатусПродавца.ПустаяСсылка)
					|		И Сотрудник = &Сотрудник
					|		) КАК КадроваяИстория
					//|ГДЕ
					//|	КадроваяИстория.СтатусПродавца <> ЗНАЧЕНИЕ(Перечисление.СтатусПродавца.ПустаяСсылка)	
					|";			
				Запрос.УстановитьПараметр("ТекДата",	ТекДата);		
				Запрос.УстановитьПараметр("Сотрудник", 	ЭтотОбъект.Ссылка);
				
				бФлагУстановитьСтатус = Ложь;
				РезультатЗапроса = Запрос.Выполнить();
				Если РезультатЗапроса.Пустой() Тогда
					бФлагУстановитьСтатус = Истина;
					//Выборка = РезультатЗапроса.Выбрать();
					//Пока Выборка.Следующий() Цикл				
					//	Если Выборка.СтатусПродавца
					//		
					//	КонецЕсли;							
					//	Прервать;						
					//КонецЦикла;	
				КонецЕсли;
				
		//		// если есть необходимость установки нового статуса				
		//		Если бФлагУстановитьСтатус Тогда
		//	
		//			стрСодержание = "Инициализация нового продавца " + Строка(ЭтотОбъект.Ссылка);
		//			
		//			РегистрыСведений.КадроваяИстория.ЗаписатьКадровуюИсторию(
		//				ЭтотОбъект.Ссылка,
		//				ТекДата, 
		//				Перечисления.СтатусПродавца.Откреплен, 
		//				стрСодержание);
		//				
		//			Запрос = Новый Запрос;
		//			Запрос.Текст = 
		//				"ВЫБРАТЬ
		//				|	КадроваяИсторияСрезПоследних.Сотрудник,
		//				|	КадроваяИсторияСрезПоследних.Магазин,
		//				|	КадроваяИсторияСрезПоследних.СтатусПродавца												
		//				|ИЗ
		//				|	РегистрСведений.КадроваяИстория.СрезПоследних(
		//				|			&НаДату,
		//				|			Сотрудник = &Сотрудник
		//				|				И СтатусПродавца = &СтатусПродавца) КАК КадроваяИсторияСрезПоследних";
		//			
		//			Запрос.УстановитьПараметр("НаДату", ТекДата + 1);
		//			Запрос.УстановитьПараметр("Сотрудник", ЭтотОбъект.Ссылка);
		//			Запрос.УстановитьПараметр("СтатусПродавца", Перечисления.СтатусПродавца.Откреплен);
		//			
		//			РезультатЗапроса = Запрос.Выполнить();					
		//			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();					
		//			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		//				
		//				стрМагазин = Строка(ВыборкаДетальныеЗаписи.Магазин);
		//				стрТема = стрМагазин + ?(стрМагазин = "", "", " - ")
		//							+ Строка(ВыборкаДетальныеЗаписи.СтатусПродавца) 
		//							+ " - " + Строка(ВыборкаДетальныеЗаписи.Сотрудник);			

		//				 ЗаписьНовая = Новый Структура;
		//				 ЗаписьНовая.Вставить("Содержание", стрСодержание);						 
		//				 РаботаСРегламентныеЗаданиями.КадрыПеремещениеОтправитьПисьма(
		//					ЗаписьНовая,
		//					стрТема
		//					//массивРассылка
		//					);
		//				Прервать;	
		//				
		//			КонецЦикла;
		//
		//			
		//		КонецЕсли;
		//					
			КонецЕсли;			
		КонецЕсли;
	//-- Вялов В.Ю. - Мегаплан №3585 от 26.07.2016 - автоформирвоание пин-кода и статуса для нового

		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Код = "";
	Наименование = "";
	
КонецПроцедуры


Функция ЕстьКадроваяИстория(Сотрудник)
	
	Рез = Ложь;
	 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КадроваяИсторияСрезПоследних.Магазин,
		|	КадроваяИсторияСрезПоследних.Сотрудник
		|ИЗ
		|	РегистрСведений.КадроваяИстория.СрезПоследних(&НаДату, Сотрудник = &Сотрудник) КАК КадроваяИсторияСрезПоследних";
	
	Запрос.УстановитьПараметр("НаДату", ТекущаяДата());
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Рез = Истина;
	КонецЦикла;
	
	Возврат Рез;
	
КонецФункции

Процедура ПриЗаписи(Отказ)
	
	//++ Вялов В.Ю. - Мегаплан №3585 от 26.07.2016 - автоформирование пин-кода и статуса для нового
	
	
	//	Если ЭтоНовый() Тогда
	ГруппаПользователи = Справочники.Пользователи.НайтиПоНаименованию("Продавцы", Истина, Справочники.Пользователи.ПустаяСсылка());
	//ГруппаМагазины = Справочники.Пользователи.НайтиПоНаименованию("Магазины", Истина, ГруппаПользователи);
	Если ЗначениеЗаполнено(ГруппаПользователи) Тогда
		Если ЭтотОбъект.ПринадлежитЭлементу(ГруппаПользователи) Тогда		 
			
			Если (СокрЛП(ЭтотОбъект.Код) = "" ИЛИ НЕ ЕстьКадроваяИстория(ЭтотОбъект.Ссылка)) Тогда 
				
				ТекДата = ТекущаяДата();
				
				
				стрТема = "Новый сотрудник - без прикрепления к магазину - " +
				Строка(ЭтотОбъект.Ссылка) + " (" + СокрЛП(ЭтотОбъект.Код) + ")";
				
				стрСодержание =  "Дата кадрового события : "
				+ Формат(ТекДата, "ДФ='dd.MM.yy  HH:mm'") + Символы.ПС
				+ "Инициализация нового продавца" + Символы.ПС;
				
				РегистрыСведений.КадроваяИстория.ЗаписатьКадровуюИсторию(
				ЭтотОбъект.Ссылка,
				ТекДата, 
				Перечисления.СтатусПродавца.Откреплен, 
				стрСодержание);
				
				//#***+Изменения*** Тасмаджиев 30/11/2018// ->>
				//За ненадобностью
				//Запрос = Новый Запрос;
				//Запрос.Текст = 
				//	"ВЫБРАТЬ
				//	|	КадроваяИсторияСрезПоследних.Сотрудник,
				//	|	КадроваяИсторияСрезПоследних.Магазин,
				//	|	КадроваяИсторияСрезПоследних.СтатусПродавца												
				//	|ИЗ
				//	|	РегистрСведений.КадроваяИстория.СрезПоследних(
				//	|			&НаДату,
				//	|			Сотрудник = &Сотрудник
				//	|				И СтатусПродавца = &СтатусПродавца) КАК КадроваяИсторияСрезПоследних";
				//
				//Запрос.УстановитьПараметр("НаДату", ТекДата + 1);
				//Запрос.УстановитьПараметр("Сотрудник", ЭтотОбъект.Ссылка);
				//Запрос.УстановитьПараметр("СтатусПродавца", Перечисления.СтатусПродавца.Откреплен);
				//
				//РезультатЗапроса = Запрос.Выполнить();					
				//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();					
				//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				//	
				//	стрМагазин = Строка(ВыборкаДетальныеЗаписи.Магазин);
				//	//стрТема = стрМагазин + ?(стрМагазин = "", "", " - ")
				//	//			+ Строка(ВыборкаДетальныеЗаписи.СтатусПродавца) 
				//	//			+ " - " + Строка(ВыборкаДетальныеЗаписи.Сотрудник);			
				//			
				//	стрСодержание = стрСодержание +
				//		"ФИО продавца : " + Строка(ЭтотОбъект.Ссылка) + Символы.ПС
				//		+ "ФИО ответственного за событие : " 
				//		+ Строка(ПараметрыСеанса.ТекущийПользователь);
				
				//	 ЗаписьНовая = Новый Структура;
				//	 ЗаписьНовая.Вставить("Содержание", стрСодержание);	
				//	 КодКадровогоИзменения = 0;
				//	 РаботаСРегламентныеЗаданиями.КадрыПеремещениеОтправитьПисьма(
				//		ЗаписьНовая,
				//		стрТема,
				//		КодКадровогоИзменения	// 0-новый, 1-согл.розн., 2-согл.СБ, 3-прикреплен, 4-откреплен, 5-уволен, 6-отпуск
				//		);
				//	Прервать;	
				//	
				//КонецЦикла;
				//#***-Изменения*** Тасмаджиев 30/11/2018// <<-
				
			КонецЕсли;	
			
		КонецЕсли;			
	КонецЕсли;
	//-- Вялов В.Ю. - Мегаплан №3585 от 26.07.2016 - автоформирвоание пин-кода и статуса для нового
	
	
КонецПроцедуры
